[
  [
    "Variable Name",
    "Description"
  ],
  [
    "masspay_txn_id_x",
    "For Mass Payments, a unique transaction\nID generated by the PayPal system, where x is\nthe record number of the mass pay itemLength: 19 characters"
  ],
  [
    "mc_currency_x",
    "For Mass Payments, the currency of the amount\nand fee, where x is the record number the mass\npay item"
  ],
  [
    "mc_fee_x",
    "For Mass Payments, the transaction fee associated\nwith the payment, where x is the record number\nthe mass pay item"
  ],
  [
    "mc_gross_x",
    "The gross amount for the amount, where x is\nthe record number the mass pay item"
  ],
  [
    "mc_handlingx",
    "The x is\nthe shopping cart detail item number. The handling_cart cart-wide\nWebsite Payments variable is also included in the mc_handling variable;\nfor this reason, the sum of mc_handlingx might\nnot be equal to mc_handling"
  ],
  [
    "payment_date",
    "For Mass Payments, the first IPN is the\ndate/time when the record set is processed. Format: HH:MM:SS DD\nMmm YYYY PSTLength: 28 characters"
  ],
  [
    "payment_status",
    "Completed: For Mass Payments,\nthis means that all of your payments have been claimed, or after\na period of 30 days, unclaimed payments have been returned to you.Denied:\nFor Mass Payments, this means that your funds were not sent and\nthe Mass Payment was not initiated. This may have been caused by lack\nof funds.Processed: Your Mass Payment has\nbeen processed and all payments have been sent."
  ],
  [
    "reason_code_x",
    "This variable is set only if status = Failed.\n    1001 Receiver's account is invalid\n    1002 Sender has insufficient funds\n    1003 User's country is not allowed\n    1004 User's credit card is not in the list of allowed countries of the gaming merchant\n    3004 Cannot pay self\n    3014 Sender's account is locked or inactive\n    3015 Receiver's account is locked or inactive \n    3016 Either the sender or receiver exceeded the transaction limit\n    3017 Spending limit exceeded\n    3047 User is restricted\n    3078 Negative balance\n    3148 Receiver's address is in a non-receivable country or a PayPal zero country\n    3535 Invalid currency\n    3547 Sender's address is located in a restricted State \n    3558 Receiver's address is located in a restricted State \n    3769 Market closed and transaction is between 2 different countries\n    4001 Internal error\n    4002 Internal error\n    8319 Zero amount\n    8330 Receiving limit exceeded\n    8331 Duplicate Mass payment\n    9302 Transaction was declined \n    11711 Per-transaction sending limit exceeded\n    14159 Transaction currency cannot be received by the recipient\n    14550 Currency compliance\n    14764 Regulatory review - Pending\n    14765 Regulatory review - Blocked\n    14767 Receiver is unregistered\n    14768 Receiver is unconfirmed\n    14769 Youth account recipient\n    14800 POS cumulative sending limit exceeded"
  ],
  [
    "receiver_email_x",
    "For Mass Payments, the primary email address\nof the payment recipient, where x is the record\nnumber of the mass pay item.Length: 127 characters"
  ],
  [
    "status_x",
    "For Mass Payments, the status of the payment,\nwhere x is the record number\nCompleted: The payment has been processed, regardless of whether this was originally\na unilateral payment\nFailed: The payment failed because of an insufficient PayPal balance.\nReturned: When an unclaimed payment remains unclaimed for more than 30 days, it is returned to the sender.\nReversed: PayPal has reversed the transaction.\nUnclaimed: This is for unilateral payments that are unclaimed.\nPending:  The payment is pending because it is being reviewed for compliance with government regulations. The review will be completed and the payment status will be updated within 72 hours. \nBlocked: This payment was blocked due to a violation of government regulations."
  ],
  [
    "unique_id_x",
    "For Mass Payments, the unique ID from input,\nwhere x is the record number. This allows the\nmerchant to cross-reference the paymentLength: 13 characters"
  ]
]
